app/views/questions/index.html.erb

SELECT "choices".* FROM "choices" WHERE "choices"."question_id" = ?  [["question_id", 6]]
---
      <ul>
        <% question.choices.each do |choice| %>